Repository: rainavyas/Logic_Simulator
Catalog: gf2_python/locale/*/LC_MESSAGES/logicsimapp.po
Languages: fr, hi

source: time
fr: temps
hi: पहर

source: Canvas Cleared
fr: Toile débarrassée
hi: कैनवस साफ़ हो गया

source: About
fr: Sur
hi: स्विचिंग सिग्नल

source: Exit
fr: Quitter
hi: छोड़ना

source: File
fr: Fichier
hi: फ़ाइल

source: Select Source File
fr: Sélectionner le fichier source
hi: स्रोत फ़ाइल का चयन करें

source: Cycles:
hi: चक्र:

source: Monitor Points
fr: Points de surveillance
hi: मॉनिटर अंक

source: Run
fr: Exécuter
hi: निष्पादित

source: Continue
fr: Continuer
hi: जारी रहना

source: Reset Position
fr: Réinitialiser la position
hi: स्थिति रीसेट करें

source: Add
fr: Ajouter
hi: जोड़ना

source: Switch to 2D Traces
fr: Passer aux traces 2D
hi: 2 डी निशान पर स्विच करें

source: SELECT
fr: Sélectionner
hi: चुनते हैं

source: Logic Simulator Created by Jonty Page,
fr: Simulateur logique Créé par Jonty Page,
hi: तर्क सिम्युलेटर जोंटी पेज द्वारा बनाया गया,

source: Vyas Raina and James Crossley 2019
fr: Vyas Raina et James Crossley 2019
hi: व्यास रैना और जेम्स क्रॉसली

source: About Logsim
fr: À propos de Logsim
hi: खिड़की के बारे में

source: New spin control value:
fr: Nouvelle valeur de contrôle de spin:
hi: नई स्पिन नियंत्रण मूल्य:

source: Drawing signal
fr: Signal de dessin
hi: संकेत खींचना

source: Error! Network oscillating.
fr: Erreur! Réseau oscillant.
hi: त्रुटि! नेटवर्क दोलन।

source: Run button pressed.
fr: Bouton executer enfoncé.
hi: रन बटन दबाया।

source: Position reset.
fr: Réinitialisation de la position
hi: स्थिति रीसेट।

source: Error! Nothing to continue. Run first.
fr: Erreur! Rien à continuer. Courez en premier.
hi: त्रुटि! जारी रखने के लिए कुछ भी नहीं। पहले दौड़ो।

source: Monitor Point %s added.
fr: Points de surveillance %s ajoutée.
hi: मॉनिटर अंक %s जोड़ा

source: Remove
fr: Retirer
hi: हटाना

source: Monitor Point %s removed.
fr: Points de surveillance &s retirer.
hi: मॉनिटर अंक %s हटा दिया

source: On
fr: Sur
hi: पर

source: %s turned on.
fr: %s allumé.
hi: %s कामोत्तेजित

source: Off
fr: De
hi: बंद

source: %s turned off.
fr: %s éteindre.
hi: %s कामोत्तेजित

source: Switch Values:
fr: Valeurs des commutateurs
hi: मान बदलें:

source: ERROR - FILE INVALID - %s Errors
fr: ERRUER - FICHIER INVALIDE - %s Erruers
hi: त्रुटि - फ़ाइल इनवैलिड -%s त्रुटियां

source: RUNTIME ERROR
fr: ERREUR D'EXÉCUTION
hi: रनटाइम त्रुटि

source: Switch to 3D Traces
fr: Passer aux traces 3D
hi: 3 डी निशान पर स्विच करें

source: Switching signal
fr: Signal de commutation
hi: स्विचिंग सिग्नल
